In [1]:
import pandas as pd
import sqlalchemy
import pprint
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
#!pip install psycopg2
from pathlib import Path
from sqlalchemy import create_engine, text

In [3]:
# Import the dependencies.
import psycopg2
from pathlib import Path
from sqlalchemy import create_engine, text

# Create a reference to the file. 
database_path = Path("../Resources/schema.sql")

In [4]:
connection = psycopg2.connect(user = "postgres",
                             password = "12345",
                             port = "5432",
                             database = "Employee_DB")

In [5]:
connection

In [6]:
from sqlalchemy import create_engine
 
#engine = create_engine('postgresql+psycopg2://user:password\
#@hostname/database_name')

engine = create_engine('postgresql+psycopg2://postgres:12345@localhost:5432/Employee_DB')
connection = engine.connect()

In [7]:
employees = pd.read_sql('select e.emp_no,e.last_name,e.first_name,e.sex,s.salary from employees e,salaries s where e.emp_no = s.emp_no', connection)
employees.head()

   emp_no  last_name first_name sex  salary
0   57444       Babb      Berry   F   48973
1  263976   Cusworth       Eran   M   40000
2  461591   Samarati     Xudong   M   40000
3  477657  Magliocco     Lihong   M   54816
4   29920      Tyugu    Shuichi   F   40000

In [8]:
### Import the Employees table"
#Created a view for the hire date in postgres sql
employees_hiredate = pd.read_sql('select * from employee_hire_date' , connection)
employees_hiredate.head()

   emp_no   last_name first_name sex   hire_date
0   19490      Heuter    Odoardo   M  1986-12-31
1  104952    Hopewell  Moriyoshi   M  1986-12-31
2  100673       Jiang       Giri   M  1986-12-31
3  291977      Pettis       Kinh   M  1986-12-31
4   12462  Schmittgen    Zhenhua   M  1986-12-31

In [9]:
### Import the Departments  manager
#method 1
Manager = pd.read_sql(' select e.emp_title_id as manager,d.dept_name,dm.dept_no, dm.emp_no, e.last_name as manager_last_name, e.first_name as manager_first_name from dept_manager dm,employees e,dept_emp de,departments d where de.emp_no=dm.emp_no and de.dept_no = dm.dept_no and e.emp_no = dm.emp_no and e.emp_no = de.emp_no and dm.dept_no = d.dept_no;', connection)
                          
Manager.head()

,manager,dept_name,dept_no,emp_no,manager_last_name,manager_first_name
0,m0001,Marketing,d001,110022,Markovitch,Margareta
1,m0001,Marketing,d001,110039,Minakawa,Vishwani
2,m0001,Finance,d002,110085,Alpin,Ebru
3,m0001,Finance,d002,110114,Legleitner,Isamu
4,m0001,Human Resources,d003,110183,Ossenbruggen,Shirish

In [16]:
#list Department Manager Number
#method 2

department_mgr = pd.read_sql ('SELECT dept_manager.dept_no, dept_manager.emp_no, employees.last_name, employees.first_name, departments.dept_name FROM dept_manager LEFT JOIN departments ON dept_manager.dept_no = departments.dept_no LEFT JOIN employees ON dept_manager.emp_no = employees.emp_no ORDER BY emp_no', connection)

department_mgr.head()

  dept_no  emp_no     last_name first_name        dept_name
0    d001  110022    Markovitch  Margareta        Marketing
1    d001  110039      Minakawa   Vishwani        Marketing
2    d002  110085         Alpin       Ebru          Finance
3    d002  110114    Legleitner      Isamu          Finance
4    d003  110183  Ossenbruggen    Shirish  Human Resources

In [17]:
 ###  List the department of each employee with the following information: 
dept = pd.read_sql('SELECT employees.emp_no, employees.last_name, employees.first_name, dept_emp.dept_no, departments.dept_name FROM employees INNER JOIN dept_emp ON employees.emp_no=dept_emp.emp_no INNER JOIN departments ON departments.dept_no=dept_emp.dept_no order by emp_no', connection)
dept.head()

   emp_no last_name first_name dept_no        dept_name
0   10001   Facello     Georgi    d005      Development
1   10002    Simmel    Bezalel    d007            Sales
2   10003   Bamford      Parto    d004       Production
3   10004   Koblick  Chirstian    d004       Production
4   10005  Maliniak    Kyoichi    d003  Human Resources

In [12]:
###List first name, last name, and sex of each employee whose first name is Hercules and whose last name begins with the letter B.
#LastNameB = pd.read_sql('select * from employees where first_name = 'Hercules' and last_name.str.startswith('B')', connection)
#created a view for firstname Hercules & lastName with B


LastNameB = pd.read_sql('select * from lastnameB', connection)

LastNameB.head()

   emp_no emp_title_id  birth_date first_name  last_name sex   hire_date
0   38161        s0001  1964-10-12   Hercules       Baer   M  1988-02-17
1  276181        s0001  1957-10-17   Hercules      Biron   F  1994-12-07
2  236650        e0002  1964-12-24   Hercules      Birge   F  1994-04-13
3  482148        e0003  1954-04-05   Hercules    Berstel   F  1989-11-02
4  210097        e0003  1954-08-27   Hercules  Bernatsky   M  1985-11-27

In [13]:
#List each employee in the Sales department, including their employee number, last name, and first name.
#Created a view for the employee sales in postgres Sql

emp_Sales = pd.read_sql('select * from emp_Sales', connection)
emp_Sales.head()

   emp_no    last_name first_name dept_no dept_name
0   10002       Simmel    Bezalel    d007     Sales
1   10016  Cappelletti   Kazuhito    d007     Sales
2   10034         Swan      Bader    d007     Sales
3   10041       Lenart        Uri    d007     Sales
4   10050       Dredge    Yinghua    d007     Sales

In [14]:
#List each employee in the Sales and Development departments, including their employee number, last name, first name, and department name.
#Created a view in postgres sql for the employee sales & Dev 

emp_sales_dev = pd.read_sql('select * from emp_sales_dev', connection)

emp_sales_dev.head()

   emp_no  last_name first_name dept_no    dept_name
0   10001    Facello     Georgi    d005  Development
1   10002     Simmel    Bezalel    d007        Sales
2   10006    Preusig     Anneke    d005  Development
3   10008   Kalloufi     Saniya    d005  Development
4   10012  Bridgland   Patricio    d005  Development

In [15]:
### List the frequency counts, in descending order, of all the employee last names (that is, how many employees share each last name).
Freq_Counts = pd.read_sql('SELECT last_name, COUNT(*) AS freq_count FROM employees GROUP BY last_name ORDER BY freq_count DESC;', connection)

Freq_Counts.head()

  last_name  freq_count
0      Baba         226
1    Gelosh         223
2     Coorg         223
3    Farris         222
4   Sudbeck         222